## Pandas Assignment - I
***By Shahequa Modabbera***

```
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
```

In [1]:
import pandas as pd
series1 = pd.Series([4, 8, 15, 16, 23, 42])
series1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

```
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
```

In [2]:
list1 = [(i+1)**2 for i in range(10)]
series2 = pd.Series(list1)
series2

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

```
Q3. Create a Pandas DataFrame that contains the following data:
```

|   Name    |     Age   |    Gender |
| --------- | --------- | --------- |
|   Alice   |    25     |  Female   | 
|   Bob     |    30     |  Male     |
|   Claire  |    27     |  Female   |

```
Then, print the DataFrame.
```

In [3]:
df = pd.DataFrame({"Name": ['Alice', 'Bob', 'Claire'],
                    "Age": [25, 30, 27],
                 "Gender": ['Female', 'Male', 'Female']
                  })
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

```
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
```

`Ans) The Pandas DataFrame is a two-dimensional data structure composed of columns and rows. We can think of the DataFrame as similar to a CSV or relational database table. It is a primary object in Pandas and is used to represent and manipulate data with rows and columns.`

`The Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns. It is similar to a column in a DataFrame.`

In [4]:
import pandas as pd

##Creating a DataFrame
df1 = pd.DataFrame({"Name": ['Alice', 'Bob', 'Claire'],
                    "Age": [25, 30, 27],
                 "Gender": ['Female', 'Male', 'Female']
                  })

##Creating a Series from the DataFrame
names = df1['Name']

##Printing the DataFrame and Series
print("DataFrame:")
print(df1)
print()
print("Series:")
print(names)

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series:
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [5]:
##Checking type of DataFrame
type(df1)

pandas.core.frame.DataFrame

In [6]:
##Checking type of Series
type(names)

pandas.core.series.Series

```
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
```

`Ans) Pandas provides many functions to manipulate data in a DataFrame. Here are some common functions that can be used to manipulate data in a Pandas DataFrame:`

1) head() and tail(): These functions are used to view the first or last n rows of a DataFrame respectively. They are useful to quickly inspect the structure and contents of a DataFrame.

In [7]:
import pandas as pd
#Create a DataFrame
df = pd.DataFrame({"Name": ['Alice', 'Bob', 'Claire', 'Alex', 'Tom', 'Jerry'],
                    "Age": [25, 30, 27, 34, 32, None],
                 "Gender": ['Female', 'Male', 'Female', 'Male', 'Male', 'Male'],
                   "City": ['Pune', 'Delhi', 'Mumbai', None, 'Pune', 'Bangalore'],
                   "Salary": [40000, None, 90000, 80000, 50000, 60000]
                  })

In [8]:
df.head(1)

    Name   Age  Gender  City   Salary
0  Alice  25.0  Female  Pune  40000.0

In [9]:
df.tail(1)

    Name  Age Gender       City   Salary
5  Jerry  NaN   Male  Bangalore  60000.0

2) describe(): This function is used to compute summary statistics of a DataFrame, such as count, mean, standard deviation, minimum, and maximum values. It is useful to quickly get a sense of the distribution and range of values in a DataFrame.

In [10]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   29.600000  64000.000000
std     3.646917  20736.441353
min    25.000000  40000.000000
25%    27.000000  50000.000000
50%    30.000000  60000.000000
75%    32.000000  80000.000000
max    34.000000  90000.000000

3) dropna(): This function removes any row with missing values.

In [11]:
df.dropna(axis=0)

     Name   Age  Gender    City   Salary
0   Alice  25.0  Female    Pune  40000.0
2  Claire  27.0  Female  Mumbai  90000.0
4     Tom  32.0    Male    Pune  50000.0

4) fillna(): This function fills missing values with a specified value or method.

In [12]:
df.fillna(0)

     Name   Age  Gender       City   Salary
0   Alice  25.0  Female       Pune  40000.0
1     Bob  30.0    Male      Delhi      0.0
2  Claire  27.0  Female     Mumbai  90000.0
3    Alex  34.0    Male          0  80000.0
4     Tom  32.0    Male       Pune  50000.0
5   Jerry   0.0    Male  Bangalore  60000.0

5) groupby(): This function is used to group rows in a DataFrame based on one or more columns, and apply an aggregation function, such as mean, sum, count, or custom functions, to each group. It is useful to analyze the relationship between different variables in a dataset.

In [13]:
df.groupby('Gender').mean(numeric_only=True)

         Age        Salary
Gender
Female  26.0  65000.000000
Male    32.0  63333.333333

```
Q6. Which of the following is mutable in nature:
Series, DataFrame, Panel?
```

`Ans) Series are mutable, which means that we can change the value of an element in the series after it has been initialized.`

`DataFrames are both value-mutable and size-mutable (Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed). This lets us perform operations that would alter values held within the DataFrame or add/delete columns to/from the DataFrame.`

`A Panel is a 3D array. It is not as widely used as Series or DataFrames. It is not as easily displayed on screen or visualized as the other two because of its 3D nature. It is generally used for 3D time-series data. It is both value-mutable and size-mutable.`

```
Q7. Create a DataFrame using multiple Series. Explain with an example.
```

`Ans) By using concat() method we can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. While using axis=0 appends series to rows instead of columns.`

In [14]:
import pandas as pd

##Create pandas Series
name = pd.Series(['Shahequa', 'Imaan', 'Azlin'], name='Name')
course = pd.Series(['Data Science', 'Web Development', 'Machine Learning'], name='Course')
fees = pd.Series([3500, 3200, 3000], name='Fees')

##Combine multiple Series
df = pd.concat([name, course, fees], axis=1)
print(df)

       Name            Course  Fees
0  Shahequa      Data Science  3500
1     Imaan   Web Development  3200
2     Azlin  Machine Learning  3000